In [29]:
import numpy as np 
import pandas as pd

In [30]:
t = (1,2,3,4)
t[1:3]

(2, 3)

In [33]:
dictionary = {"name":["jhon","sara","abdullah","ahmet","kubra","saleh"],
             "age":[20,18,None,50,25,70],
             "note":[125,665,20,988,409,None]}
dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

       name   age   note
0      jhon  20.0  125.0
1      sara  18.0  665.0
2  abdullah   NaN   20.0
3     ahmet  50.0  988.0
4     kubra  25.0  409.0
5     saleh  70.0    NaN

In [34]:
df = pd.read_csv(r"C:\Users\abdul\Downloads\freshman_lbs.csv")
print(df)

   Sex   "Weight (lbs   Sep)"   "Weight (lbs.1   Apr)"   "BMI (Sep)"  \
0    M            159     130            22.02   18.14           NaN
1    M            214     190            19.70   17.44           NaN
2    M            163     152            24.09   22.43           NaN
3    M            205     194            26.97   25.57           NaN
4    F            150     141            21.51   20.10           NaN
..  ..            ...     ...              ...     ...           ...
62   M            143     156            22.51   24.45           NaN
63   M            165     181            23.69   25.80           NaN
64   F             93     108            15.08   17.74           NaN
65   M            163     181            22.64   25.33           NaN
66   M            207     231            36.57   40.86           NaN

     "BMI (Apr)"
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
..           ...
62           NaN
63           NaN
64           NaN
65           NaN
66           NaN

[67 rows x 7 columns]

In [35]:
head = dataframe1.head() 
print(head)

       name   age   note
0      jhon  20.0  125.0
1      sara  18.0  665.0
2  abdullah   NaN   20.0
3     ahmet  50.0  988.0
4     kubra  25.0  409.0

In [36]:
tail = dataframe1.tail()
print(tail)

       name   age   note
1      sara  18.0  665.0
2  abdullah   NaN   20.0
3     ahmet  50.0  988.0
4     kubra  25.0  409.0
5     saleh  70.0    NaN

In [37]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [38]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes
None

In [39]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [40]:
print(dataframe1.describe())

             age        note
count   5.000000    5.000000
mean   36.600000  441.400000
std    22.645088  396.076129
min    18.000000   20.000000
25%    20.000000  125.000000
50%    25.000000  409.000000
75%    50.000000  665.000000
max    70.000000  988.000000

In [44]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])            
dataframe1["new_feature"] = [1,2,3,4,5,6] 
print(dataframe1.loc[:3,"age"])
print(dataframe1.loc[:3, "name":"note"])
print(dataframe1.loc[::-1])

0        jhon
1        sara
2    abdullah
3       ahmet
4       kubra
5       saleh
Name: name, dtype: object
0    20.0
1    18.0
2     NaN
3    50.0
4    25.0
5    70.0
Name: age, dtype: float64
0    20.0
1    18.0
2     NaN
3    50.0
Name: age, dtype: float64
       name   age   note
0      jhon  20.0  125.0
1      sara  18.0  665.0
2  abdullah   NaN   20.0
3     ahmet  50.0  988.0
       name   age   note  new_future  new_feature
5     saleh  70.0    NaN           6            6
4     kubra  25.0  409.0           5            5
3     ahmet  50.0  988.0           4            4
2  abdullah   NaN   20.0           3            3
1      sara  18.0  665.0           2            2
0      jhon  20.0  125.0           1            1

In [45]:
print(dataframe1.loc[:, "new_feature"])

0    1
1    2
2    3
3    4
4    5
5    6
Name: new_feature, dtype: int64

In [46]:
print(dataframe1.loc[:3, ["name","note"]])

       name   note
0      jhon  125.0
1      sara  665.0
2  abdullah   20.0
3     ahmet  988.0

In [47]:
print(dataframe1.loc[:,:"age"])

       name   age
0      jhon  20.0
1      sara  18.0
2  abdullah   NaN
3     ahmet  50.0
4     kubra  25.0
5     saleh  70.0

In [48]:
print(dataframe1.iloc[:,[2]])

    note
0  125.0
1  665.0
2   20.0
3  988.0
4  409.0
5    NaN

In [49]:
filtre1 = dataframe1.age>10
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  20.0   True
1  18.0   True
2   NaN  False
3  50.0   True
4  25.0   True
5  70.0   True

In [50]:
type(filtre1)

pandas.core.series.Series

In [51]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

    name   age   note  new_future  new_feature  bool
0   jhon  20.0  125.0           1            1  True
1   sara  18.0  665.0           2            2  True
3  ahmet  50.0  988.0           4            4  True
4  kubra  25.0  409.0           5            5  True
5  saleh  70.0    NaN           6            6  True

In [52]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

    name   age   note  new_future  new_feature  bool
0   jhon  20.0  125.0           1            1  True
1   sara  18.0  665.0           2            2  True
3  ahmet  50.0  988.0           4            4  True
4  kubra  25.0  409.0           5            5  True

In [53]:
dataframe1[dataframe1.age>20]

    name   age   note  new_future  new_feature  bool
3  ahmet  50.0  988.0           4            4  True
4  kubra  25.0  409.0           5            5  True
5  saleh  70.0    NaN           6            6  True

In [54]:
mean1 = dataframe1.note.mean()
print(mean1)
mean_np= np.mean(dataframe1.note) 
print(mean_np)

441.4
441.4

In [55]:
dataframe1.dropna(inplace=True) 
dataframe1

    name   age   note  new_future  new_feature  bool
0   jhon  20.0  125.0           1            1  True
1   sara  18.0  665.0           2            2  True
3  ahmet  50.0  988.0           4            4  True
4  kubra  25.0  409.0           5            5  True

In [56]:
print(dataframe1.note.mean())
dataframe1["mean"]= ["bad" if dataframe1.note.mean()>each else "good" for each in dataframe1.note]
dataframe1

546.75

    name   age   note  new_future  new_feature  bool  mean
0   jhon  20.0  125.0           1            1  True   bad
1   sara  18.0  665.0           2            2  True  good
3  ahmet  50.0  988.0           4            4  True  good
4  kubra  25.0  409.0           5            5  True   bad

In [57]:
dataframe1.columns = [each.upper() for each in dataframe1.columns] 

dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'NEW_FUTURE', 'NEW_FEATURE', 'BOOL', 'MEAN'], dtype='object')

In [58]:
dataframe1.drop(["NEW_FUTURE"],axis=1,inplace=True)
dataframe1

    NAME   AGE   NOTE  NEW_FEATURE  BOOL  MEAN
0   jhon  20.0  125.0            1  True   bad
1   sara  18.0  665.0            2  True  good
3  ahmet  50.0  988.0            4  True  good
4  kubra  25.0  409.0            5  True   bad

In [59]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

    NAME   AGE   NOTE  NEW_FEATURE  BOOL  MEAN
0   jhon  20.0  125.0            1  True   bad
1   sara  18.0  665.0            2  True  good
3  ahmet  50.0  988.0            4  True  good
4  kubra  25.0  409.0            5  True   bad
0   jhon  20.0  125.0            1  True   bad
1   sara  18.0  665.0            2  True  good
3  ahmet  50.0  988.0            4  True  good
4  kubra  25.0  409.0            5  True   bad

In [60]:
data_contact2 = pd.concat([data1,data2],axis=1)
data_contact2

,NAME,AGE,NOTE,NEW_FEATURE,BOOL,MEAN,NAME,AGE,NOTE,NEW_FEATURE,BOOL,MEAN
0,jhon,20.0,125.0,1,True,bad,jhon,20.0,125.0,1,True,bad
1,sara,18.0,665.0,2,True,good,sara,18.0,665.0,2,True,good
3,ahmet,50.0,988.0,4,True,good,ahmet,50.0,988.0,4,True,good
4,kubra,25.0,409.0,5,True,bad,kubra,25.0,409.0,5,True,bad

In [61]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]
dataframe1

    NAME   AGE   NOTE  NEW_FEATURE  BOOL  MEAN  new_age
0   jhon  20.0  125.0            1  True   bad     40.0
1   sara  18.0  665.0            2  True  good     36.0
3  ahmet  50.0  988.0            4  True  good    100.0
4  kubra  25.0  409.0            5  True   bad     50.0